Repository: ReceiptManager/receipt-manager-app
Catalog: lib/l10n/intl_*.arb
Languages: de_de

# appBarTitle
source: Receipt manager
de_de: Mein Haushaltsbuch

# settingsGeneralCategory
source: Common
de_de: Allgemein

# settingsLanguageTitle
source: Language
de_de: Sprache

# currentLanguage
source: English
de_de: Deutsch

# settingsDeveloperTitle
source: Developer
de_de: Entwickler

# settingsDeveloperSubtitle
source: Developer utils
de_de: Entwickelerwerkzeuge

# settingsNetworkCategory
source: Network
de_de: Netzwerk

# settingsServerTitle
source: Server
de_de: Netzwerk Einstellungen

# settingsDevelopmentTitle
source: Development
de_de: Entwicklung

source: Enable debug output
de_de: Entwicklerinformationen anzeigen

# settingsMiscTitle
source: Misc
de_de: Verschiedenes

# openSourceLicence
source: Open source licenses
de_de: Open-Source Lizenzen

source: Add receipt
de_de: Kassenbeleg hinzugefügen

# receiptEmpty
source: Please enter some date
de_de: Bitte geben Sie ein Datum ein

# receiptDateLabelText
source: Receipt date
de_de: Datum

# receiptDateHelperText
source: Set the receipt date
de_de: Füge das Datum das Kassenbeleg hinzu

# receiptDateNotFormatted
source: Date is not formatted
de_de: Eingabeformat ungültig

# receiptSelectCategory
source: Select receipt category
de_de: Wähle eine Kategorie

# invalidInput
source: Input appears invalid.
de_de: Eingabe is ungültig

# uploadFailed
source: Failed to upload image.
de_de: Bild konnte nicht hochgeladen werden

# uploadSuccess
source: Image successfully uploaded.
de_de: Bild erfolgreich hochgeladen

# receiptLoadFailed
source: Error Occur, could not load receipts
de_de: Ein Fehler ist aufgetreten, Kassenbelege konnten nicht geladen werden

# deleteReceipt
source: Delete
de_de: Löschen

# editReceipt
source: Update
de_de: Editieren

source: Update Receipt
de_de: Kassenbeleg aktualisieren

# updateReceiptSuccessful
source: Update receipt successfully
de_de: Beleg erfolgreich aktualisiert

# failedUpdateReceipt
source: Failed to update receipt
de_de: Beleg wurde nicht aktualisiert

source: Cancel
de_de: Abbrechen

source: Update
de_de: Aktualisieren

# serverIPLabelText
source: Server ip address
de_de: Server IP Addresse

# serverIPHelpText
source: Set the image server ip
de_de: Zugangs-Server Addresse

source: Server Settings
de_de: Server Einstellungen

# invalidServerIP
source: The given submitted server IP appear invalid. Please try again.
de_de: Die eingegebene IP war falsch. Bitte versuchen Sie es erneut

# updateServerIP
source: Server ip is set.
de_de: Zugangs-Server Addresse aktualisiert.

# groceryCategory
source: Grocery
de_de: Lebensmittel

# healthCategory
source: Health
de_de: Gesundheit

# storeNameTitle
source: Store name
de_de: Shop Name

# storeNameHint
source: Store name
de_de: Shop Name

# storeNameHelper
source: Set the store name
de_de: Füge einen Shop Namen hinzu

# emptyStoreName
source: 'Please enter a store name.
de_de: 'Bitte gebe einen Shop Namen an.

# totalTitle
source: Receipt total
de_de: Betrag

# totalLabelText
source: Receipt total
de_de: Betrag

# totalHelperText
source: Receipt total
de_de: Füge den Betrag des Beleges hinzu

# emptyTotal
source: Please enter the total.
de_de: Bitte geben einen Betrag an

# invalidTotal
source: Total is invalid.
de_de: Betrag ist ungültig

source: Language
de_de: Sprache

source: Monday
de_de: Montag

source: Tuesday
de_de: Dienstag

source: Wednesday
de_de: Mittwoch

source: Thursday
de_de: Donnerstag

source: Friday
de_de: Freitag

source: Saturday
de_de: Samstag

source: Sunday
de_de: Sonntag

# overviewExpenses
source: Expenses overview
de_de: Ausgabenübersicht

# overview
source: Weekly overview
de_de: Wochenübersicht

source: Server timeout
de_de: Server Zeitüberschreibung

# socketException
source: Can't connect to the server
de_de: Keine Verbindung zum Server möglich

# handshakeException
source: Bad certificate. Please regenerate the certificate
de_de: Zertifikat ungültig

# generalException
source: Ups something went wrong
de_de: Etwas ist schief gelaufen

source: Server ip is not set.
de_de: Server IP ist undefiniert.

source: Entertainment
de_de: Unterhaltung

source: Skip
de_de: Überspringen

# startsDescription
source: Analyse personal expenses with detailed charts and filter categories.
de_de: Analyisiere deine persönlichen Ausgaben.

# statsTitle
source: Track your expenses with statistics
de_de: Deine Ausgaben auf einem Blick

# ocrTitle
source: Parse receipt via tesseract
de_de: Füge deine Einkaufszettel aus Bildern hinzu

# ocrDescription
source: Parse receipts using optical character recognition.
de_de: Durch tesseract können Bilder automatisch analysiert werden

source: Next
de_de: Weiter

source: Done
de_de: Geschaft

# noReceipts
source: There are no receipts inserted.
de_de: Keine Belege wurden hinzugefügt

source: Rent
de_de: Miete

source: Food
de_de: Essen

# employeeBenefits
source: Benefits
de_de: Sozialleistungen

source: Util
de_de: Sonstiges

source: Travel
de_de: Reisen

source: Education
de_de: Bildung

source: Expenses by category
de_de: Kategorieübersicht
